Revit 2024 API
GroupTypeId.ElectricalAnalysis Property
 Electrical Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId ElectricalAnalysis { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalAnalysis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalAnalysis {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace